# Функциональное приветствие
# Большинство задач этой главы ориентировано на отработку навыков по разработке функций.
#
# Ваше решение будет использоваться как библиотека.
#
# Напишите функцию print_hello, которая принимает имя пользователя и выводит приветствие в стандартный поток вывода.
#
# Примечание
# Ваше решение должно содержать только функции.
# В решении не должно быть вызовов требуемых функций.

def print_hello(username):
    print(f'Hello, {username}!')
