# Делу — время, потехе — час
# Давайте передохнём от автоматизации и сделаем что-то действительно интересное.

# Формат ввода
# Одно натуральное число N

# Формат вывода
# N строк с фразой: "Купи слона!"
phrase_count = int(input())
phrase = 'Купи слона!\n'

print(phrase * phrase_count, end='')